using System;
using System.Collections.Generic;
using System.Text;
using System.Linq;

namespace Hajir.Crm
{
    public partial class HajirCrmConstants
    {
        public class LegacyMaps
        {
            private const string _RelationsMap = @"
رقیب	رقیب
مشاور	مشاور
-	مشتری
مشتری	مشتری
سرمایه گذار	مشتری
شریک تجاری	مشتری
تاثیر گذار	مشاور
رسانه	مشتری
مشتری احتمالی	مشتری
نماینده فروش	نماینده
تامین کننده	تامین کننده
تولید کننده	مشتری
سایر	مشتری
مناقصه ها	مشتری
نمایندگان	نماینده
همکاران	همکار
تدارکات	تامین کننده
نمایندگان خدمات	همکار خدمات
خدمات	مشتری
تبلیغات	مشتری
";

            private const string _Industry = @"سایر	خدمات عمومی
اینترنت	اینترنتی
لیزر	تجهیزات پزشکی
سفارت	ادارات دولتی و وزارتخانه ها
نظامی	نظامی و قضایی
بازرگانی	بازرگانی
باسکول	باسکول و توزین
عمده فروشی	خدمات عمومی
فلزات و خودرو	خودرو
تولیدی و کارگاهی متوسط و کوچک	کارخانجات تولیدی
دارویی و غذایی	غذایی
دارویی،غذایی آرایشی و بهداشتی	دارویی و آرایشی بهداشتی
صنعتی،پزشکی،بیمارستانی،دیتاسنتر	پزشکی و آزمایشگاهی (مطب، درمانگاه، داروخانه و ...)
لوازم خانگی ،نساجی و پوشاك	کارخانجات تولیدی
سخت افزار،شبکه	فناوری اطلاعات IT (مراکز داده (دیتا سنتر)، شبکه، سخت افزار، نرم افزار)
صنعت آب و فاضلاب	آب و فاضلاب
مشاور،پیمانکار،حقیقی	شخص حقیقی
سولار و انرژي هاي نوين	انرژی های نوین و سولار  (سیستم های خورشیدی) 
فروش محصولات سرگرمی	مراکز خرید و مجتمع تجاری
خرده فروشی وسایل نقلیه	خدمات عمومی
موسسه کاریابی،شغل یابی	خدمات عمومی
لوازم خانگی،لوازم آشپزخانه	کارخانجات تولیدی
فراوری مواد غذایی و دخانیات	غذایی
تولید و توزیع امکانات عمومی	خدمات عمومی
تامین اجتماعی،مدیریت درمان	تامین اجتماعی و مدیریت درمان (بیمارستان های دولتی)
مخابرات-مخابراتي و مراكز تلفن	مخابراتی
فنآوری اطلاعات،پلیکیشن،IT‏	فناوری اطلاعات IT (مراکز داده (دیتا سنتر)، شبکه، سخت افزار، نرم افزار)
توزیع و استخراج محصولات پتروشیمی	نفت، گاز، پتروشیمی
آزانس کرایه اتومبیل،مشاور املاک،آرایشگاه	خدمات عمومی
نرم افزار-اتوماسيون اداري،مالی و حسابداری	فناوری اطلاعات IT (مراکز داده (دیتا سنتر)، شبکه، سخت افزار، نرم افزار)
تاسیسات-سرمایشی،گرمایشی،تهویه مطبوع	تاسیسات، سرمایشی، گرمایشی، تهویه مطبوع
اتحادیه صنفی،نظام صنفی،انجمن صنفی،انجمن	خدمات عمومی
کارگزاری ها، مالی،بانک،هولدینگ،بیمه،بورس،سرمایه	بانک
ایمنی و آتش نشانی-تجهیزات ایمنی،دوربین مداربسته	سیستم های حفاظتی (دوربین مدار بسته، دزدگیر و ...)
برق والكترونيك -ابزار دقیق،الکترونیک و اتوماسیون صنعتی	برق و الکترونیک (ابزار دقیق ، اتوماسیون صنعتی و ...)
مطب ها و کلینیک های پزشکی،بیمارستان و تجهیزات پزشکی	پزشکی و آزمایشگاهی (مطب، درمانگاه، داروخانه و ...)
بنیاد،بنیادمستضعفان،بنیاد شهید،آستان قدس،حرم، بقاع متبرکه	ادارات دولتی و وزارتخانه ها
هواشناسی،زلزله شناسی،مدیریت بحران،هلال احمر،استاندارد،هلال احمر	ادارات دولتی و وزارتخانه ها
شهرداری،فرمانداری ،استانداری	شهرداری، فرمانداری، استانداری، بخشداری، دهیاری
خدمات اجتماعی،خدمات بهزیستی،خدمات مددکاری،خیریه،ترک اعتیاد،درمانگاه	خدمات عمومی
شهرداری،فرمانداري ،استانداری،بخشداری،دهداری،شورای شهر،شورایاری،دهیاری	شهرداری، فرمانداری، استانداری، بخشداری، دهیاری
صنایع و کارخانه های بزرگ	کارخانجات تولیدی
دامپروري ،امور عشایر،جهاد کشاورزی،کشاورزی و استخراج منابع طبیعی غیر نفتی	ادارات دولتی و وزارتخانه ها
لیزینگ تجهیزات، تعمیرگاه،خدمات پس از فروش،بازیافت،خورده فروشی وسایل یدکی	خدمات عمومی
مشاوره مدیریت،مدیریت اقتصادی،مشاوره راهبردی،مراکز و مشاوره تحقیق و توسعه	خدمات عمومی
ثبت اسناد،ثبت احوال،دفتر پیشخوان دولت،دفترخانه،سازمان املاک و اموال،امور مالیاتی،پلیس+10	ثبت اسناد، ثبت احوال
نفت و گاز و پتروشیمی-استخراج و پخش مواد شیمیایی نفتی،پتروشیمی،تجهیزات صنعت نفت و گاز	نفت، گاز، پتروشیمی
رستوران،هتل،گردشگری،جهانگردی،میهمانخانه،مسافرخانه،توریست،آژانس مسافرتی،میراث فرهنگی	خدمات گردشگری (آژانس مسافرتی، رستوران ، هتل و ...)
مرکز خرید،مرکز اداری و تجاری،مجتمع تجاری،فروشگاه زنجیره ای،برج مسکونی،بازارچه،پاساژ،مال،هایپر،	مراکز خرید و مجتمع تجاری
پلاستيك ،عايقها،صنايع معدنی،شیمیایی،شیشه،سلولزی،چاپ و نشر-صنایع چوب،کاغذ،لوله،اتصالات ،تهیه و تولید مواد نسوز	شیشه، پلاستیک، چوب و مواد نسوز
حمل و نقل وترافيك-ترابري،کنترل کیفیت،صنایع ریلی و مترو،کشتی سازی و خدمات دریایی، تکنولوژی جابجایی،هوایی،فرودگاهی و فرودگاه	حمل و نقل
تربیت بدنی،ورزش جوانان،باشگاه ورزشی،سالن بدنسازی،ورزشگاه،فروشگاه لوازم ورزشی،دوچرخه و متور سیکلت فروشی،اداره ورزش و جوانان	خدمات عمومی
ساختمان -معماري،شهرسازي،نقشه برداری،دکوراسیون ،مصالح ساختمانی،سیمان،کاشی،سرامیک و چینی	ساختمانی
آموزشی و فرهنگی-دانشگاهها،دانشکده ها، تئاتر،سینما،کانون فرهنگی،آموزشگاهها	آموزشی
";

            private const string _Salutaion = @"Ms	سرکار خانم
Mr	جناب آقای
جناب آقای کاپیتان	جناب آقای
جناب آقای	جناب آقای
جناب آقای مهندس	آقای مهندس
جناب آقای دکتر	آقای دکتر
سرکار خانم	سرکار خانم
سرکار خانم مهندس	خانم مهندس
سرکار خانم دکتر	خانم دکتر
";
            private const string _roles = @"Employee;کارمند
ِInfluencer;تاثیرگذار
Decision Maker;تصمیم گیرنده";

            private const string _nahve_ashnaei_map = @"سایر	سایر
همکاران و آشنایان	همکاران و آشنایان
ملاقات حضوری	فعالیت های مشتری یابی
فعالیت های مشتری یابی	فعالیت های مشتری یابی
اینترنت و سایت	سایت هژیر صنعت
کاتالوگ و رزومه	کاتالوگ و رزومه
ماهنامه رایانه	تبلیغات در مجلات و ماهنامه ها
علم و الکترونیک	تبلیغات در مجلات و ماهنامه ها
ماهنامه نت	تبلیغات در مجلات و ماهنامه ها
کتاب اول	تبلیغات در مجلات و ماهنامه ها
کتاب مقدم	تبلیغات در مجلات و ماهنامه ها
نمایشگاه	نمایشگاه
خرید قبلی	خرید قبلی
خبرنامه	خبرنامه
";
            private static Dictionary<string, string> ToDictionary(string input)
            {
                return input
                    .Split('\n')
                    .Select(x => x.Trim())
                    .Where(x => !string.IsNullOrWhiteSpace(x) && x.Split('\t', ';').Length > 1)
                    .Select(x => x.Split('\t', ';'))
                    .ToDictionary(x => x[0], x => x[1]);

            }

            public static Dictionary<string, string> RelationShipMap => ToDictionary(_RelationsMap);
            public static Dictionary<string, string> IndustryMap => ToDictionary(_Industry);

            public static Dictionary<string, string> SalutaionMap => ToDictionary(_Salutaion);

            public static Dictionary<string, string> NahveAshnaeiMap => ToDictionary(_nahve_ashnaei_map);
            public static Dictionary<string, string> Roles => new Dictionary<string, string> {
                {"Employee","کارمند" },
                {"Decision Maker","تصمیم گیرنده" },
                {"Influencer","تاثیر گذار" }
            };

        }
    }
}
